In [1]:
# Aaggregated data

import json
import pandas as pd

# Load the JSON file into a Python object for the Aaggregated data - 2022
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2022/1.json") as f:
    data_2022_Agg_Trans_1 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2022/2.json") as f:
    data_2022_Agg_Trans_2 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2022/3.json") as f:
    data_2022_Agg_Trans_3 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2022/4.json") as f:
    data_2022_Agg_Trans_4 = json.load(f)

# Load the JSON file into a Python object for the Aaggregated data - 2021
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2021/1.json") as f:
    data_2021_Agg_Trans_1 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2021/2.json") as f:
    data_2021_Agg_Trans_2 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2021/3.json") as f:
    data_2021_Agg_Trans_3 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2021/4.json") as f:
    data_2021_Agg_Trans_4 = json.load(f)
    
# Load the JSON file into a Python object for the Aaggregated data - 2020
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2020/1.json") as f:
    data_2020_Agg_Trans_1 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2020/2.json") as f:
    data_2020_Agg_Trans_2 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2020/3.json") as f:
    data_2020_Agg_Trans_3 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2020/4.json") as f:
    data_2020_Agg_Trans_4 = json.load(f)    

    
# Load the JSON file into a Python object for the Aaggregated data - 2019
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2019/1.json") as f:
    data_2019_Agg_Trans_1 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2019/2.json") as f:
    data_2019_Agg_Trans_2 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2019/3.json") as f:
    data_2019_Agg_Trans_3 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2019/4.json") as f:
    data_2019_Agg_Trans_4 = json.load(f)   
    
# Load the JSON file into a Python object for the Aaggregated data - 2018
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2018/1.json") as f:
    data_2018_Agg_Trans_1 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2018/2.json") as f:
    data_2018_Agg_Trans_2 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2018/3.json") as f:
    data_2018_Agg_Trans_3 = json.load(f)
with open("C:/Users/Mayur/pulse/data/aggregated/transaction/country/india/2018/4.json") as f:
    data_2018_Agg_Trans_4 = json.load(f)   
      
    
df_2022_Agg_Trans_1 = pd.json_normalize(data_2022_Agg_Trans_1['data']['transactionData'],'paymentInstruments', ['name'])
df_2022_Agg_Trans_2 = pd.json_normalize(data_2022_Agg_Trans_2['data']['transactionData'],'paymentInstruments', ['name'])
df_2022_Agg_Trans_3 = pd.json_normalize(data_2022_Agg_Trans_3['data']['transactionData'],'paymentInstruments', ['name'])
df_2022_Agg_Trans_4 = pd.json_normalize(data_2022_Agg_Trans_4['data']['transactionData'],'paymentInstruments', ['name'])

df_2021_Agg_Trans_1 = pd.json_normalize(data_2022_Agg_Trans_1['data']['transactionData'],'paymentInstruments', ['name'])
df_2021_Agg_Trans_2 = pd.json_normalize(data_2022_Agg_Trans_2['data']['transactionData'],'paymentInstruments', ['name'])
df_2021_Agg_Trans_3 = pd.json_normalize(data_2022_Agg_Trans_3['data']['transactionData'],'paymentInstruments', ['name'])
df_2021_Agg_Trans_4 = pd.json_normalize(data_2022_Agg_Trans_4['data']['transactionData'],'paymentInstruments', ['name'])

df_2020_Agg_Trans_1 = pd.json_normalize(data_2022_Agg_Trans_1['data']['transactionData'],'paymentInstruments', ['name'])
df_2020_Agg_Trans_2 = pd.json_normalize(data_2022_Agg_Trans_2['data']['transactionData'],'paymentInstruments', ['name'])
df_2020_Agg_Trans_3 = pd.json_normalize(data_2022_Agg_Trans_3['data']['transactionData'],'paymentInstruments', ['name'])
df_2020_Agg_Trans_4 = pd.json_normalize(data_2022_Agg_Trans_4['data']['transactionData'],'paymentInstruments', ['name'])

df_2019_Agg_Trans_1 = pd.json_normalize(data_2022_Agg_Trans_1['data']['transactionData'],'paymentInstruments', ['name'])
df_2019_Agg_Trans_2 = pd.json_normalize(data_2022_Agg_Trans_2['data']['transactionData'],'paymentInstruments', ['name'])
df_2019_Agg_Trans_3 = pd.json_normalize(data_2022_Agg_Trans_3['data']['transactionData'],'paymentInstruments', ['name'])
df_2019_Agg_Trans_4 = pd.json_normalize(data_2022_Agg_Trans_4['data']['transactionData'],'paymentInstruments', ['name'])

df_2018_Agg_Trans_1 = pd.json_normalize(data_2022_Agg_Trans_1['data']['transactionData'],'paymentInstruments', ['name'])
df_2018_Agg_Trans_2 = pd.json_normalize(data_2022_Agg_Trans_2['data']['transactionData'],'paymentInstruments', ['name'])
df_2018_Agg_Trans_3 = pd.json_normalize(data_2022_Agg_Trans_3['data']['transactionData'],'paymentInstruments', ['name'])
df_2018_Agg_Trans_4 = pd.json_normalize(data_2022_Agg_Trans_4['data']['transactionData'],'paymentInstruments', ['name'])

display(df_2022_Agg_Trans_1)
display(df_2022_Agg_Trans_2)
display(df_2022_Agg_Trans_3)
display(df_2022_Agg_Trans_4)

    type       count        amount                      name
0  TOTAL  3748851071  2.272818e+12         Merchant payments
1  TOTAL  3074250150  1.050594e+13     Peer-to-peer payments
2  TOTAL   749674246  4.475998e+11  Recharge & bill payments
3  TOTAL     4035100  4.921212e+09        Financial Services
4  TOTAL    16393502  8.422766e+09                    Others

    type       count        amount                      name
0  TOTAL  4765203787  2.847097e+12         Merchant payments
1  TOTAL  3506141323  1.212352e+13     Peer-to-peer payments
2  TOTAL   845751926  5.230461e+11  Recharge & bill payments
3  TOTAL     3272822  3.889787e+09        Financial Services
4  TOTAL    11241480  6.711034e+09                    Others

    type       count        amount                      name
0  TOTAL  5618132071  3.151615e+12         Merchant payments
1  TOTAL  3957113406  1.283780e+13     Peer-to-peer payments
2  TOTAL   956164949  6.070487e+11  Recharge & bill payments
3  TOTAL     3959631  4.514223e+09        Financial Services
4  TOTAL    10005043  6.725900e+09                    Others

    type       count        amount                      name
0  TOTAL  6565690145  3.673601e+12         Merchant payments
1  TOTAL  4459859921  1.457887e+13     Peer-to-peer payments
2  TOTAL   991049281  6.497768e+11  Recharge & bill payments
3  TOTAL     4623387  5.360528e+09        Financial Services
4  TOTAL    10013085  7.361493e+09                    Others

In [6]:
# This code to manipulate Year and quarter

List1 = []
Year = 2022
for i in range(5):
    List1.append(Year)
    
print(List1)

[2022, 2022, 2022, 2022, 2022]

In [11]:
# This code to manipulate Year and Quarter

# [First, First, First, First, First]
# [Second, Second, Second, Second, Second]
# [Third, Third, Third, Third, Third]
# [Fourth, Fourth, Fourth, Fourth, Fourth]

df_2022_Agg_Trans_1['Quarter'] = ['First', 'First', 'First', 'First', 'First']
df_2022_Agg_Trans_2['Quarter'] = ['Second', 'Second', 'Second', 'Second', 'Second']
df_2022_Agg_Trans_3['Quarter'] = ['Third', 'Third', 'Third', 'Third', 'Third']
df_2022_Agg_Trans_4['Quarter'] = ['Fourth', 'Fourth', 'Fourth', 'Fourth', 'Fourth']

df_2021_Agg_Trans_1['Quarter'] = ['First', 'First', 'First', 'First', 'First']
df_2021_Agg_Trans_2['Quarter'] = ['Second', 'Second', 'Second', 'Second', 'Second']
df_2021_Agg_Trans_3['Quarter'] = ['Third', 'Third', 'Third', 'Third', 'Third']
df_2021_Agg_Trans_4['Quarter'] = ['Fourth', 'Fourth', 'Fourth', 'Fourth', 'Fourth']

df_2020_Agg_Trans_1['Quarter'] = ['First', 'First', 'First', 'First', 'First']
df_2020_Agg_Trans_2['Quarter'] = ['Second', 'Second', 'Second', 'Second', 'Second']
df_2020_Agg_Trans_3['Quarter'] = ['Third', 'Third', 'Third', 'Third', 'Third']
df_2020_Agg_Trans_4['Quarter'] = ['Fourth', 'Fourth', 'Fourth', 'Fourth', 'Fourth']

df_2019_Agg_Trans_1['Quarter'] = ['First', 'First', 'First', 'First', 'First']
df_2019_Agg_Trans_2['Quarter'] = ['Second', 'Second', 'Second', 'Second', 'Second']
df_2019_Agg_Trans_3['Quarter'] = ['Third', 'Third', 'Third', 'Third', 'Third']
df_2019_Agg_Trans_4['Quarter'] = ['Fourth', 'Fourth', 'Fourth', 'Fourth', 'Fourth']

df_2018_Agg_Trans_1['Quarter'] = ['First', 'First', 'First', 'First', 'First']
df_2018_Agg_Trans_2['Quarter'] = ['Second', 'Second', 'Second', 'Second', 'Second']
df_2018_Agg_Trans_3['Quarter'] = ['Third', 'Third', 'Third', 'Third', 'Third']
df_2018_Agg_Trans_4['Quarter'] = ['Fourth', 'Fourth', 'Fourth', 'Fourth', 'Fourth']

In [15]:
display(df_2018_Agg_Trans_1)
display(df_2018_Agg_Trans_2)
display(df_2018_Agg_Trans_3)
display(df_2018_Agg_Trans_4)

df_Agg_Trans_2022 = pd.concat([df_2022_Agg_Trans_1, df_2022_Agg_Trans_2, df_2022_Agg_Trans_3, df_2022_Agg_Trans_4], axis=0)
df_Agg_Trans_2021 = pd.concat([df_2021_Agg_Trans_1, df_2021_Agg_Trans_2, df_2021_Agg_Trans_3, df_2021_Agg_Trans_4], axis=0)
df_Agg_Trans_2020 = pd.concat([df_2020_Agg_Trans_1, df_2020_Agg_Trans_2, df_2020_Agg_Trans_3, df_2020_Agg_Trans_4], axis=0)
df_Agg_Trans_2019 = pd.concat([df_2019_Agg_Trans_1, df_2019_Agg_Trans_2, df_2019_Agg_Trans_3, df_2019_Agg_Trans_4], axis=0)
df_Agg_Trans_2018 = pd.concat([df_2018_Agg_Trans_1, df_2018_Agg_Trans_2, df_2018_Agg_Trans_3, df_2018_Agg_Trans_4], axis=0)

df_Agg_Trans = pd.concat([df_Agg_Trans_2022,df_Agg_Trans_2021,df_Agg_Trans_2020,df_Agg_Trans_2019,df_Agg_Trans_2018], axis=0)

#df_Agg_Trans.to_excel("df_Agg_Transaction.xlsx")

display(df_Agg_Trans)

    type       count        amount                      name  Year Quarter
0  TOTAL  3748851071  2.272818e+12         Merchant payments  2018   First
1  TOTAL  3074250150  1.050594e+13     Peer-to-peer payments  2018   First
2  TOTAL   749674246  4.475998e+11  Recharge & bill payments  2018   First
3  TOTAL     4035100  4.921212e+09        Financial Services  2018   First
4  TOTAL    16393502  8.422766e+09                    Others  2018   First

    type       count        amount                      name  Year Quarter
0  TOTAL  4765203787  2.847097e+12         Merchant payments  2018  Second
1  TOTAL  3506141323  1.212352e+13     Peer-to-peer payments  2018  Second
2  TOTAL   845751926  5.230461e+11  Recharge & bill payments  2018  Second
3  TOTAL     3272822  3.889787e+09        Financial Services  2018  Second
4  TOTAL    11241480  6.711034e+09                    Others  2018  Second

    type       count        amount                      name  Year Quarter
0  TOTAL  5618132071  3.151615e+12         Merchant payments  2018   Third
1  TOTAL  3957113406  1.283780e+13     Peer-to-peer payments  2018   Third
2  TOTAL   956164949  6.070487e+11  Recharge & bill payments  2018   Third
3  TOTAL     3959631  4.514223e+09        Financial Services  2018   Third
4  TOTAL    10005043  6.725900e+09                    Others  2018   Third

    type       count        amount                      name  Year Quarter
0  TOTAL  6565690145  3.673601e+12         Merchant payments  2018  Fourth
1  TOTAL  4459859921  1.457887e+13     Peer-to-peer payments  2018  Fourth
2  TOTAL   991049281  6.497768e+11  Recharge & bill payments  2018  Fourth
3  TOTAL     4623387  5.360528e+09        Financial Services  2018  Fourth
4  TOTAL    10013085  7.361493e+09                    Others  2018  Fourth

TypeError: concat() got an unexpected keyword argument 'index'

In [80]:
#df_2022_Agg_Trans_4.drop(['Quarter'],axis = 1, inplace=True)